/* Задача

Первый входной массив содержит правильные ответы на экзамен, например ["a", "a", "b", "d"]. 
Второй массив содержит отправленные студентом ответы.

Два массива не пусты и имеют одинаковую длину. Верните оценку для этого массива ответов, 
указав +4 за каждый правильный ответ, -1 за каждый неправильный ответ и +0 за каждый пустой ответ, 
представленный в виде пустой строки (в C используется пробел).

Если результат < 0, вернитесь 0.

Например:

    Correct answer    |    Student's answer   |   Result         
 ---------------------|-----------------------|-----------
 ["a", "a", "b", "b"]   ["a", "c", "b", "d"]  →     6
 ["a", "a", "c", "b"]   ["a", "a", "b", "" ]  →     7
 ["a", "a", "b", "c"]   ["a", "a", "b", "c"]  →     16
 ["b", "c", "b", "a"]   ["" , "a", "a", "c"]  →     0

*/

function checkExam(array1, array2) {
  let count = 0;
  for (let i = 0; i < array1.length; i++) {
    if (array2[i] === array1[i]) {
      count = count + 4;
    } else if (array2[i] === "") {
      count = count;
    } else {
      count = count - 1;
    }
  }
  console.log(count < 0 ? 0 : count);
  return count < 0 ? 0 : count;
}

checkExam(["b", "c", "b", "a"], ["", "a", "a", "c"]);
